tap "withered-magic/brew"
tap "xcodesorg/made"

# Formulae
brew "aria2"
brew "awscli"
brew "bazelisk"
brew "cocoapods"
brew "coreutils"
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-town"
brew "go"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "just"
brew "lazygit"
brew "lcov"
brew "luarocks"
brew "neovide"
brew "neovim"
brew "node"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "socat"
brew "sourcery"
brew "swift-sh"
brew "swiftformat"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "withered-magic/brew/starpls"
brew "xcodesorg/made/xcodes"
brew "zsh"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "arc"
cask "beekeeper-studio"
cask "bettertouchtool"
cask "cmux"
cask "copilot-for-xcode"
cask "cursor"
cask "deckset"
cask "devutils"
cask "fertigt-slate"
cask "ghostty"
cask "hiddenbar"
cask "hopper-disassembler"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "loom"
cask "loopback"
cask "meetingbar"
cask "nslogger"
cask "obsidian"
cask "proxyman"
cask "readdle-spark"
cask "reveal"
cask "roon"
cask "sim-genie"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "xcodes-app"
